# Prerequisites
brew "mas"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

# 3rd Party services
tap "stripe/stripe-cli"
brew "stripe/stripe-cli/stripe"

# Development Tools
tap "puma/puma"
brew "puma/puma/puma-dev"

# Shells
brew "fish"

# Misc
brew "asdf"
brew "autoconf"
brew "automake"
brew "bat"
brew "coreutils"
brew "curl"
brew "efm-langserver"
brew "exa"
brew "fd"
brew "fop"
brew "fx"
brew "fzf"
brew "gdk-pixbuf"
brew "gh"
brew "git"
brew "glib"
brew "gnupg"
brew "gnutls"
brew "gobject-introspection"
brew "graphviz"
brew "harfbuzz"
brew "hub"
brew "jq"
brew "kerl"
brew "librsvg"
brew "libtool"
brew "libxslt"
brew "libyaml"
brew "lua-language-server"
brew "openjdk"
brew "openssl@3"
brew "pango"
brew "pgcli"
brew "readline"
brew "redis"
brew "ripgrep"
brew "subversion"
brew "tealdeer"
brew "tmux"
brew "tree"
brew "unzip"
brew "wxwidgets"
brew "yt-dlp"

cask "barrier"
cask 'gpg-suite'
cask "font-fira-code-nerd-font"
cask "font-fira-mono-for-powerline"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "insomnia"
cask "signal"

# Archive
# brew "neovim"
# cask "wkhtmltopdf"
